Repository: python/pootle-python-org-backup
Catalog: tmxes/fr/whatsnew.tmx
Source language: en
Languages: fr

source: What's New in Python 2.0
fr: Nouveautés de Python 2.0

source: Author
fr: Auteur

source: A.M. Kuchling and Moshe Zadka
fr: A.M. Kuchling et Moshe Zadka

source: New Development Process
fr: Nouveau processus de développement

source: The *sqlite3* module has some new features:
fr: Le module *sqlite3* a quelques nouvelles fonctionnalités :

source: (Contributed by Antoine Pitrou; :issue:`3001`.)
fr: (Contribution par Antoine Pitrou; :issue:`3001`.)

source: Regular and recursive locks now accept an optional *timeout* argument to their ``acquire`` method. (Contributed by Antoine Pitrou; :issue:`7316`) Similarly, :meth:`threading.Semaphore.acquire` also gains a *timeout* argument. (Contributed by Torsten Landschoff; :issue:`850728`.)
fr: Les verrous standards et récursifs acceptent désormais un argument optionnel *timeout* à leur méthode ``acquire``. (Contribution par Antoine Pitrou; :issue:`7316`). Pareillement, :meth:`threading.Semaphore.acquire` acquière d'un argument *timeout* (Contribution par Torsten Landschoff; :issue:`850728`).

source: Porting to Python 3.2
fr: Portage vers Python 3.2

source: bytearray objects cannot be used anymore as filenames: convert them to bytes
fr: Les objets bytearray ne peuvent plus être utilisés en tant que nom de fichiers : les convertir en octets

source: PyArg_Parse*() functions:
fr: Les fonctions PyArg_Parse*() :

source: "t#" format has been removed: use "s#" or "s*" instead
fr: Le format "t#" a été supprimé : utiliser "s#" ou "s*" à la place

source: "w" and "w#" formats has been removed: use "w*" instead
fr: Les formats "w" et "w#" ont été supprimés : utiliser "w*" à la place

source: What's New in Python
fr: Quoi de neuf dans Python

source: The "What's New in Python" series of essays takes tours through the most important changes between major Python versions. They are a "must read" for anyone wishing to stay up-to-date after a new release.
fr: La série d'essais "Quoi de neuf dans Python" reprend les plus importants changements entres les versions majeures de Python. Elles sont à lire pour quiconque souhaitant être à jour suite à une nouvelle sortie.
